Wire Size Table "[Fail Name]" is missing or invalid. Use Electrical Settings to select a valid Wire Size Table.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId MissingOrInvalidWireSizeTable { get; }
  Visual Basic
Public Shared ReadOnly Property MissingOrInvalidWireSizeTable As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ MissingOrInvalidWireSizeTable {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ElectricalFailures Class
  Autodesk.Revit.DB Namespace